### Problema: Registro de estudiantes

**Tareas:**

1. Leer el archivo CSV usando Pandas.

2. Mostrar los estudiantes que tienen calificación mayor a 85.

3. Calcular la edad promedio de los estudiantes.

4. Agregar una columna nueva llamada Aprobado que diga "Sí" si la calificación es mayor o igual a 80 y "No" si es menor.

5. Guardar el DataFrame modificado en un nuevo archivo CSV llamado estudiantes_modificado.csv.

In [4]:
import pandas as pd

df = pd.read_csv('estudiantes.csv')
df.head(10)

  Nombre  Edad  Calificacion
0    Ana    20            85
1   Luis    22            90
2  Carla    21            78
3  Pedro    23            92
4  María    20            88
5  Sofía    22            81
6  Jorge    24            95
7  Elena    21            79
8  Diego    23            87
9  Lucía    20            91

In [9]:
df['Nombre'][df['Calificacion']>85]

1       Luis
3      Pedro
4      María
6      Jorge
8      Diego
9      Lucía
11     Paula
12      Raúl
14    Andrés
Name: Nombre, dtype: object

In [10]:
df['Edad'].mean()

np.float64(21.866666666666667)

In [15]:
df['Aprobado'] = df['Calificacion'].apply(lambda x: 'Sí' if x >= 80 else 'No')
df.head()

  Nombre  Edad  Calificacion Aprobado
0    Ana    20            85       Sí
1   Luis    22            90       Sí
2  Carla    21            78       No
3  Pedro    23            92       Sí
4  María    20            88       Sí

In [14]:
df.to_csv('estudiantes_modificado.csv', index=False)